Freespirits/esp32-openclaw-onthego/examples/esp32-node/main/app_main.c
/*
 * SPDX-FileCopyrightText: 2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include "esp_mochi_node_example_cmd.h"
#include "esp_mochi_node_example_repl.h"
#include "esp_mochi_node_example_repl_cmd.h"
#include "esp_mochi_node_example_saved_session_reconnect.h"
#include "esp_mochi_node.h"
#include "esp_mochi_node_wifi.h"

#include "esp_event.h"
#include "esp_log.h"
#include "esp_netif.h"
#include "nvs_flash.h"
#include "soc/soc_caps.h"

static const char *TAG = "app_main";
static esp_mochi_node_handle_t s_node;
static esp_mochi_node_example_saved_session_reconnect_t s_saved_session_reconnect;

static void handle_node_event(
    esp_mochi_node_handle_t node,
    esp_mochi_node_event_t event,
    const void *event_data,
    void *user_ctx)
{
    (void)node;

    esp_mochi_node_example_saved_session_reconnect_handle_event(
        (esp_mochi_node_example_saved_session_reconnect_t *)user_ctx,
        event,
        event_data);

    if (event == ESP_MOCHI_NODE_EVENT_CONNECTED) {
        ESP_LOGI(TAG, "Mochi session connected");
    } else if (event == ESP_MOCHI_NODE_EVENT_CONNECT_FAILED) {
        const esp_mochi_node_connect_failed_event_t *failed = event_data;
        ESP_LOGW(
            TAG,
            "Mochi connect failed: reason=%d local_err=%s gateway_detail=%s",
            failed != NULL ? failed->reason : -1,
            failed != NULL ? esp_err_to_name(failed->local_err) : "n/a",
            failed != NULL && failed->gateway_detail_code != NULL ? failed->gateway_detail_code : "");
    } else if (event == ESP_MOCHI_NODE_EVENT_DISCONNECTED) {
        const esp_mochi_node_disconnected_event_t *disconnected = event_data;
        ESP_LOGW(
            TAG,
            "Mochi disconnected: reason=%d local_err=%s",
            disconnected != NULL ? disconnected->reason : -1,
            disconnected != NULL ? esp_err_to_name(disconnected->local_err) : "n/a");
    }
}

#if !SOC_WIFI_SUPPORTED
#error "examples/esp32-node is a Wi-Fi-specific example and requires a Wi-Fi-capable ESP32 target"
#endif

void app_main(void)
{
    esp_err_t err = nvs_flash_init();
    if (err == ESP_ERR_NVS_NO_FREE_PAGES || err == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        err = nvs_flash_init();
    }
    ESP_ERROR_CHECK(err);
    ESP_ERROR_CHECK(esp_netif_init());
    ESP_ERROR_CHECK(esp_event_loop_create_default());

    ESP_ERROR_CHECK(esp_mochi_node_wifi_start());

    esp_mochi_node_config_t node_config = {0};
    esp_mochi_node_config_init_default(&node_config);
    node_config.event_cb = handle_node_event;
    node_config.event_user_ctx = &s_saved_session_reconnect;
    ESP_ERROR_CHECK(esp_mochi_node_create(&node_config, &s_node));
    ESP_ERROR_CHECK(esp_mochi_node_example_register_node_commands(s_node));
    ESP_ERROR_CHECK(
        esp_mochi_node_example_saved_session_reconnect_start(
            &s_saved_session_reconnect,
            s_node,
            "esp_mochi_node_reconnect"));
    ESP_ERROR_CHECK(esp_mochi_node_example_repl_start(s_node));

    if (!esp_mochi_node_wifi_is_connected()) {
        ESP_LOGI(TAG, "wifi not connected yet; provision it from the REPL or wait for Wi-Fi to reconnect");
        ESP_LOGI(TAG, "after Wi-Fi is up, use `gateway setup-code`, `gateway token`, `gateway password`, or `gateway no-auth` for a first connect");
        ESP_LOGI(TAG, "saved-session reconnect runs automatically after Wi-Fi returns when a saved session is present");
    }
}
